---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.ApplicationGUID
source: html/42d848d5-5d83-23ff-f8af-ca48581c7acd.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.ApplicationGUID Property

The GUID of the application or add-in that may access entities of this Schema under the
 Application access level.

## Syntax (C#)
```csharp
public Guid ApplicationGUID { get; }
```